:PROPERTIES:
:ID:       b203da59-2639-4f04-a2a4-94acb5d79a21
:END:
#+title: Tree Sitter Grep


* identifier
:PROPERTIES:
:header-args:sh: :dir ../../
:END:

#+begin_src sh :async :exports both :results output
/home/gtrun/ghq/github.com/BrianHicks/tree-grepper/target/debug/tree-grepper --query nix '((identifier) @variable.builtin (#match? @variable.builtin "^(__currentSystem|__currentTime|__nixPath|__nixVersion|__storeDir|builtins|false|null|true)$") (#is-not? local))'
#+end_src

#+RESULTS:
#+begin_example
./lib/colmena.nix:5:29:variable.builtin:builtins
./comb/_common/nixosProfiles/bootstrap.nix:34:24:variable.builtin:true
./comb/_common/nixosProfiles/nix.nix:13:20:variable.builtin:true
./comb/_common/nixosProfiles/nix.nix:15:26:variable.builtin:true
./comb/_common/nixosProfiles/nix.nix:16:25:variable.builtin:true
./comb/_main/lib.nix:8:22:variable.builtin:builtins
./comb/guangtao/userProfiles.nix:5:29:variable.builtin:builtins
./comb/guangtao/userProfiles.nix:10:20:variable.builtin:true
./comb/guangtao/colmenaConfigurations.nix:8:29:variable.builtin:builtins
./comb/guangtao/colmenaConfigurations.nix:10:3:variable.builtin:builtins
./comb/guangtao/colmenaConfigurations.nix:16:40:variable.builtin:true
./comb/guangtao/colmenaConfigurations.nix:17:42:variable.builtin:true
./comb/guangtao/homeProfiles.nix:7:29:variable.builtin:true
./comb/guangtao/homeProfiles.nix:8:33:variable.builtin:true
./comb/guangtao/homeProfiles.nix:9:35:variable.builtin:true
./comb/guangtao/homeProfiles.nix:10:29:variable.builtin:true
./comb/guangtao/homeProfiles.nix:11:29:variable.builtin:true
./comb/guangtao/homeProfiles.nix:12:27:variable.builtin:true
./comb/guangtao/homeProfiles.nix:13:33:variable.builtin:true
./comb/guangtao/homeProfiles.nix:14:39:variable.builtin:true
./comb/guangtao/homeProfiles.nix:15:35:variable.builtin:true
./comb/guangtao/homeProfiles.nix:17:14:variable.builtin:true
./comb/guangtao/homeProfiles.nix:53:14:variable.builtin:true
./comb/guangtao/homeProfiles.nix:54:19:variable.builtin:true
./comb/guangtao/homeProfiles.nix:96:14:variable.builtin:true
./comb/guangtao/homeProfiles.nix:97:20:variable.builtin:true
./comb/guangtao/homeProfiles.nix:98:18:variable.builtin:true
./comb/guangtao/homeProfiles.nix:104:18:variable.builtin:true
./comb/guangtao/homeProfiles.nix:110:21:variable.builtin:true
./comb/guangtao/homeProfiles.nix:111:27:variable.builtin:true
./comb/guangtao/homeProfiles.nix:112:24:variable.builtin:true
./comb/guangtao/homeProfiles.nix:116:14:variable.builtin:true
./comb/guangtao/homeProfiles.nix:117:29:variable.builtin:true
./comb/guangtao/homeProfiles.nix:118:24:variable.builtin:true
./comb/guangtao/homeProfiles.nix:119:14:variable.builtin:true
./comb/guangtao/homeProfiles.nix:120:21:variable.builtin:true
./comb/_automation/devshells/default.nix:5:22:variable.builtin:builtins
./comb/_automation/devshells/default.nix:16:25:variable.builtin:false
./comb/_automation/devshells/default.nix:18:18:variable.builtin:true
./comb/guangtao/homeConfigurations.nix:17:3:variable.builtin:builtins
./comb/guangtao/homeConfigurations.nix:20:37:variable.builtin:true
./comb/guangtao/homeConfigurations.nix:26:27:variable.builtin:true
./comb/omega/homeConfigurations.nix:15:3:variable.builtin:builtins
./comb/guangtao/homeModules/programs/alacritty/default.nix:9:22:variable.builtin:builtins
./comb/guangtao/homeModules/programs/alacritty/default.nix:9:41:variable.builtin:builtins
./comb/omega/colmenaConfigurations.nix:8:3:variable.builtin:builtins
./comb/omega/nixosProfiles.nix:10:22:variable.builtin:true
./comb/omega/nixosProfiles.nix:12:28:variable.builtin:true
./comb/omega/nixosProfiles.nix:13:27:variable.builtin:true
./comb/omega/homeProfiles.nix:7:29:variable.builtin:true
./comb/omega/homeProfiles.nix:8:33:variable.builtin:true
./comb/omega/homeProfiles.nix:9:35:variable.builtin:true
./comb/omega/homeProfiles.nix:10:29:variable.builtin:true
./comb/omega/homeProfiles.nix:11:29:variable.builtin:true
./comb/omega/homeProfiles.nix:12:27:variable.builtin:true
./comb/omega/homeProfiles.nix:13:33:variable.builtin:true
./comb/omega/homeProfiles.nix:14:39:variable.builtin:true
./comb/omega/homeProfiles.nix:15:35:variable.builtin:true
./comb/omega/homeProfiles.nix:17:14:variable.builtin:true
./comb/omega/homeProfiles.nix:53:14:variable.builtin:true
./comb/omega/homeProfiles.nix:54:19:variable.builtin:true
./comb/omega/homeProfiles.nix:96:14:variable.builtin:true
./comb/omega/homeProfiles.nix:97:20:variable.builtin:true
./comb/omega/homeProfiles.nix:98:18:variable.builtin:true
./comb/omega/homeProfiles.nix:104:18:variable.builtin:true
./comb/omega/homeProfiles.nix:110:21:variable.builtin:true
./comb/omega/homeProfiles.nix:111:27:variable.builtin:true
./comb/omega/homeProfiles.nix:112:24:variable.builtin:true
./comb/omega/homeProfiles.nix:116:14:variable.builtin:true
./comb/omega/homeProfiles.nix:117:29:variable.builtin:true
./comb/omega/homeProfiles.nix:118:24:variable.builtin:true
./comb/omega/homeProfiles.nix:119:14:variable.builtin:true
./comb/omega/homeProfiles.nix:120:21:variable.builtin:true
./comb/_QUEEN/colmenaConfigurations.nix:8:3:variable.builtin:builtins
./comb/_QUEEN/lib.nix:31:47:variable.builtin:true
./comb/omega/colmenaConfigurations/blacklion/default.nix:16:32:variable.builtin:true
./comb/omega/colmenaConfigurations/blacklion/default.nix:19:37:variable.builtin:true
./comb/omega/colmenaConfigurations/blacklion/default.nix:20:42:variable.builtin:true
./comb/omega/colmenaConfigurations/blacklion/default.nix:30:24:variable.builtin:false
./comb/omega/colmenaConfigurations/blacklion/default.nix:31:40:variable.builtin:true
./comb/omega/colmenaConfigurations/blacklion/default.nix:32:40:variable.builtin:true
./comb/omega/colmenaConfigurations/blacklion/default.nix:46:29:variable.builtin:true
./comb/omega/colmenaConfigurations/blacklion/default.nix:48:26:variable.builtin:true
./comb/omega/colmenaConfigurations/blacklion/default.nix:51:48:variable.builtin:true
./comb/omega/colmenaConfigurations/blacklion/default.nix:52:50:variable.builtin:true
./comb/omega/colmenaConfigurations/blacklion/default.nix:62:18:variable.builtin:true
./comb/omega/colmenaConfigurations/blacklion/default.nix:63:32:variable.builtin:true
./comb/omega/colmenaConfigurations/blacklion/default.nix:66:38:variable.builtin:true
./comb/omega/colmenaConfigurations/blacklion/default.nix:70:20:variable.builtin:true
./comb/_QUEEN/nixosProfiles/bootstrap.nix:34:24:variable.builtin:true
#+end_example

* Path
:PROPERTIES:
:header-args:sh: :dir ../../
:END:

#+begin_src sh :async :exports both :results output
/home/gtrun/ghq/github.com/BrianHicks/tree-grepper/target/debug/tree-grepper --query nix '[ (path_expression) (hpath_expression) (spath_expression)] @string.special.path'
#+end_src

#+RESULTS:
#+begin_example
./flake.nix:31:22:string.special.path:./lib/colmena.nix
./flake.nix:42:19:string.special.path:./comb
./comb/_common/nixosProfiles.nix:7:22:string.special.path:./nixosProfiles/bootstrap.nix
./comb/_common/nixosProfiles.nix:9:16:string.special.path:./nixosProfiles/nix.nix
./comb/_docs/config.nix:7:20:string.special.path:./config/_default.nix
./comb/guangtao/userProfiles.nix:7:39:string.special.path:./.
./comb/_automation/nixago/default.nix:25:22:string.special.path:./tasks.nix
./comb/guangtao/colmenaConfigurations.nix:13:9:string.special.path:../omega/colmenaConfigurations/blacklion
./comb/guangtao/colmenaConfigurations.nix:18:46:string.special.path:./.
./comb/guangtao/homeModules/default.nix:5:22:string.special.path:./programs/alacritty
./comb/omega/colmenaConfigurations.nix:12:9:string.special.path:./colmenaConfigurations/blacklion
./comb/guangtao/homeModules/programs/alacritty/default.nix:9:59:string.special.path:./key-bindings.toml
./comb/omega/colmenaConfigurations/blacklion/default.nix:12:5:string.special.path:./hardware-configuration.nix
./comb/omega/colmenaConfigurations/blacklion/default.nix:13:5:string.special.path:./zfs.nix
./comb/_QUEEN/nixosProfiles.nix:7:22:string.special.path:./nixosProfiles/bootstrap.nix
./docs/styx/site.nix:9:17:string.special.path:<nixpkgs>
./docs/styx/site.nix:25:7:string.special.path:./conf.nix
#+end_example

* attrpaht
:PROPERTIES:
:header-args:sh: :dir ../../
:END:

#+begin_src sh :async :exports both :results output
/home/gtrun/ghq/github.com/BrianHicks/tree-grepper/target/debug/tree-grepper --query nix "(binding attrpath: (attrpath (identifier)) @property)"
#+end_src

#+RESULTS:
#+begin_example
./lib/colmena.nix:5:3:property:l
./lib/colmena.nix:6:3:property:colmena
./lib/colmena.nix:10:5:property:collect
./lib/colmena.nix:16:15:property:name
./lib/colmena.nix:20:15:property:value
./lib/colmena.nix:26:23:property:nixpkgs
./lib/colmena.nix:29:23:property:nodeNixpkgs
./lib/colmena.nix:32:29:property:name
./flake.nix:2:3:property:description
./flake.nix:4:3:property:inputs
./flake.nix:5:5:property:std.url
./flake.nix:6:5:property:std.inputs.nixpkgs.follows
./flake.nix:7:5:property:nixpkgs.url
./flake.nix:8:5:property:cells-lab.url
./flake.nix:12:3:property:inputs
./flake.nix:13:5:property:nixos-generators.url
./flake.nix:17:3:property:inputs
./flake.nix:18:5:property:nixpkgs-lock.follows
./flake.nix:19:5:property:nixos.url
./flake.nix:20:5:property:home.url
./flake.nix:24:3:property:inputs
./flake.nix:26:3:property:outputs
./flake.nix:31:5:property:colmena
./flake.nix:35:7:property:systems
./flake.nix:42:7:property:cellsFrom
./flake.nix:44:7:property:cellBlocks
./flake.nix:82:7:property:devShells
./flake.nix:92:7:property:nixConfig
./flake.nix:93:9:property:extra-substituters
./flake.nix:94:9:property:extra-trusted-public-keys
./lock/misc/flake.nix:2:3:property:description
./lock/misc/flake.nix:4:3:property:inputs
./lock/misc/flake.nix:6:5:property:styx.url
./lock/misc/flake.nix:9:3:property:outputs
./lock/default/flake.nix:2:3:property:description
./lock/default/flake.nix:4:3:property:inputs
./lock/default/flake.nix:5:5:property:colmena.url
./lock/default/flake.nix:8:3:property:inputs
./lock/default/flake.nix:10:5:property:bootsec.url
./lock/default/flake.nix:13:3:property:inputs
./lock/default/flake.nix:14:5:property:sops-nix.url
./lock/default/flake.nix:15:5:property:ragenix.url
./lock/default/flake.nix:18:3:property:outputs
./comb/_docs/entrypoints/default.nix:7:3:property:styx
./comb/_docs/entrypoints/default.nix:8:5:property:name
./comb/_docs/entrypoints/default.nix:9:5:property:runtimeInputs
./comb/_docs/entrypoints/default.nix:10:5:property:text
./comb/_docs/config/_default.nix:7:3:property:path
./comb/_docs/config/_default.nix:8:3:property:nixpkgs
./comb/_docs/config/_default.nix:14:3:property:hive
./comb/_docs/config/_default.nix:14:37:property:pkgs
./docs/styx/conf.nix:7:3:property:siteUrl
./docs/styx/conf.nix:12:3:property:theme
./comb/_docs/config.nix:7:3:property:default
./comb/_common/nixosProfiles.nix:7:3:property:bootstrap
./comb/_common/nixosProfiles.nix:9:3:property:nix
./docs/styx/site.nix:19:3:property:styx
./docs/styx/site.nix:24:5:property:config
./docs/styx/site.nix:30:5:property:themes
./docs/styx/site.nix:31:7:property:styx-themes
./docs/styx/site.nix:40:5:property:env
./docs/styx/site.nix:54:3:property:data
./docs/styx/site.nix:65:3:property:pages
./docs/styx/site.nix:66:5:property:index
./docs/styx/site.nix:67:7:property:layout
./docs/styx/site.nix:68:7:property:template
./docs/styx/site.nix:72:7:property:content
./docs/styx/site.nix:73:7:property:path
./docs/styx/site.nix:86:3:property:pageList
./docs/styx/site.nix:91:3:property:site
./comb/_common/nixosProfiles/bootstrap.nix:11:3:property:nix
./comb/_common/nixosProfiles/bootstrap.nix:12:5:property:package
./comb/_common/nixosProfiles/bootstrap.nix:13:5:property:extraOptions
./comb/_common/nixosProfiles/bootstrap.nix:18:3:property:networking.domain
./comb/_common/nixosProfiles/bootstrap.nix:19:3:property:isoImage.isoBaseName
./comb/_common/nixosProfiles/bootstrap.nix:20:3:property:isoImage.contents
./comb/_common/nixosProfiles/bootstrap.nix:22:7:property:source
./comb/_common/nixosProfiles/bootstrap.nix:23:7:property:target
./comb/_common/nixosProfiles/bootstrap.nix:26:3:property:systemd.network
./comb/_common/nixosProfiles/bootstrap.nix:28:5:property:networks."boostrap-link-local"
./comb/_common/nixosProfiles/bootstrap.nix:29:7:property:matchConfig
./comb/_common/nixosProfiles/bootstrap.nix:30:9:property:Name
./comb/_common/nixosProfiles/bootstrap.nix:32:7:property:networkConfig
./comb/_common/nixosProfiles/bootstrap.nix:33:9:property:Description
./comb/_common/nixosProfiles/bootstrap.nix:34:9:property:MulticastDNS
./comb/_common/nixosProfiles/bootstrap.nix:35:9:property:LinkLocalAddressing
./comb/_common/nixosProfiles/bootstrap.nix:36:9:property:DHCP
./comb/_common/nixosProfiles/bootstrap.nix:38:7:property:address
./comb/_common/nixosProfiles/bootstrap.nix:42:7:property:extraConfig
./comb/_common/nixosProfiles/nix.nix:11:3:property:nix
./comb/_common/nixosProfiles/nix.nix:12:5:property:package
./comb/_common/nixosProfiles/nix.nix:13:5:property:gc.automatic
./comb/_common/nixosProfiles/nix.nix:14:5:property:gc.options
./comb/_common/nixosProfiles/nix.nix:15:5:property:optimise.automatic
./comb/_common/nixosProfiles/nix.nix:16:5:property:autoOptimiseStore
./comb/_common/nixosProfiles/nix.nix:17:5:property:extraOptions
./comb/_main/lib.nix:8:3:property:l
./comb/_main/lib.nix:10:3:property:__default__
./comb/_main/lib.nix:11:5:property:nixpkgs.locked
./comb/_main/lib.nix:12:5:property:nixos.locked
./comb/_main/lib.nix:15:9:property:type
./comb/_main/lib.nix:16:9:property:owner
./comb/_main/lib.nix:17:9:property:repo
./comb/_main/lib.nix:20:5:property:colmena.inputs.nixpkgs
./comb/_main/lib.nix:21:5:property:sops-nix.inputs.nixpkgs
./comb/_main/lib.nix:22:5:property:ragenix.inputs.nixpkgs
./comb/_main/lib.nix:25:3:property:__inputs__
./comb/_main/lib.nix:26:5:property:nixpkgs.locked
./comb/_main/lib.nix:27:5:property:nixos.locked
./comb/_main/lib.nix:30:9:property:type
./comb/_main/lib.nix:31:9:property:owner
./comb/_main/lib.nix:32:9:property:repo
./comb/_main/lib.nix:35:5:property:styx.inputs.nixpkgs
./comb/guangtao/homeProfiles.nix:7:3:property:bat.programs.bat.enable
./comb/guangtao/homeProfiles.nix:8:3:property:broot.programs.broot.enable
./comb/guangtao/homeProfiles.nix:9:3:property:direnv.programs.direnv.enable
./comb/guangtao/homeProfiles.nix:10:3:property:fzf.programs.fzf.enable
./comb/guangtao/homeProfiles.nix:11:3:property:gpg.programs.gpg.enable
./comb/guangtao/homeProfiles.nix:12:3:property:jq.programs.jq.enable
./comb/guangtao/homeProfiles.nix:13:3:property:mcfly.programs.mcfly.enable
./comb/guangtao/homeProfiles.nix:14:3:property:starship.programs.starship.enable
./comb/guangtao/homeProfiles.nix:15:3:property:zoxide.programs.zoxide.enable
./comb/guangtao/homeProfiles.nix:16:3:property:gh.programs.gh
./comb/guangtao/homeProfiles.nix:17:5:property:enable
./comb/guangtao/homeProfiles.nix:18:5:property:settings.git_protocol
./comb/guangtao/homeProfiles.nix:20:3:property:packages.home.packages
./comb/guangtao/homeProfiles.nix:52:3:property:alacritty.programs.alacritty
./comb/guangtao/homeProfiles.nix:53:5:property:enable
./comb/guangtao/homeProfiles.nix:54:5:property:CSIuSupport
./comb/guangtao/homeProfiles.nix:55:5:property:settings
./comb/guangtao/homeProfiles.nix:56:7:property:env.TERM
./comb/guangtao/homeProfiles.nix:57:7:property:window.decorations
./comb/guangtao/homeProfiles.nix:58:7:property:font.size
./comb/guangtao/homeProfiles.nix:59:7:property:cursor.style
./comb/guangtao/homeProfiles.nix:62:7:property:colors
./comb/guangtao/homeProfiles.nix:64:9:property:primary
./comb/guangtao/homeProfiles.nix:65:11:property:background
./comb/guangtao/homeProfiles.nix:66:11:property:foreground
./comb/guangtao/homeProfiles.nix:70:9:property:normal
./comb/guangtao/homeProfiles.nix:71:11:property:black
./comb/guangtao/homeProfiles.nix:72:11:property:red
./comb/guangtao/homeProfiles.nix:73:11:property:green
./comb/guangtao/homeProfiles.nix:74:11:property:yellow
./comb/guangtao/homeProfiles.nix:75:11:property:blue
./comb/guangtao/homeProfiles.nix:76:11:property:magenta
./comb/guangtao/homeProfiles.nix:77:11:property:cyan
./comb/guangtao/homeProfiles.nix:78:11:property:white
./comb/guangtao/homeProfiles.nix:82:9:property:bright
./comb/guangtao/homeProfiles.nix:83:11:property:black
./comb/guangtao/homeProfiles.nix:84:11:property:red
./comb/guangtao/homeProfiles.nix:85:11:property:green
./comb/guangtao/homeProfiles.nix:86:11:property:yellow
./comb/guangtao/homeProfiles.nix:87:11:property:blue
./comb/guangtao/homeProfiles.nix:88:11:property:magenta
./comb/guangtao/homeProfiles.nix:89:11:property:cyan
./comb/guangtao/homeProfiles.nix:90:11:property:white
./comb/guangtao/homeProfiles.nix:95:3:property:git.programs.git
./comb/guangtao/homeProfiles.nix:96:5:property:enable
./comb/guangtao/homeProfiles.nix:97:5:property:delta.enable
./comb/guangtao/homeProfiles.nix:98:5:property:lfs.enable
./comb/guangtao/homeProfiles.nix:100:5:property:delta.options
./comb/guangtao/homeProfiles.nix:101:7:property:plus-style
./comb/guangtao/homeProfiles.nix:102:7:property:minus-style
./comb/guangtao/homeProfiles.nix:103:7:property:syntax-theme
./comb/guangtao/homeProfiles.nix:104:7:property:navigate
./comb/guangtao/homeProfiles.nix:107:5:property:extraConfig
./comb/guangtao/homeProfiles.nix:108:7:property:core.autocrlf
./comb/guangtao/homeProfiles.nix:109:7:property:init.defaultBranch
./comb/guangtao/homeProfiles.nix:110:7:property:pull.rebase
./comb/guangtao/homeProfiles.nix:111:7:property:rebase.autosquash
./comb/guangtao/homeProfiles.nix:112:7:property:rerere.enabled
./comb/guangtao/homeProfiles.nix:115:3:property:zsh.programs.zsh
./comb/guangtao/homeProfiles.nix:116:5:property:enable
./comb/guangtao/homeProfiles.nix:117:5:property:enableAutosuggestions
./comb/guangtao/homeProfiles.nix:118:5:property:enableCompletion
./comb/guangtao/homeProfiles.nix:119:5:property:autocd
./comb/guangtao/homeProfiles.nix:120:5:property:history.share
./comb/guangtao/homeProfiles.nix:121:5:property:dotDir
./comb/guangtao/homeProfiles.nix:122:5:property:shellGlobalAliases
./comb/guangtao/homeProfiles.nix:127:5:property:shellAliases
./comb/guangtao/homeProfiles.nix:128:7:property:d
./comb/guangtao/homeProfiles.nix:129:7:property:g
./comb/guangtao/homeProfiles.nix:130:7:property:jc
./comb/guangtao/homeProfiles.nix:131:7:property:la
./comb/guangtao/homeProfiles.nix:132:7:property:l
./comb/guangtao/homeProfiles.nix:133:7:property:ls
./comb/guangtao/homeProfiles.nix:134:7:property:md
./comb/guangtao/homeProfiles.nix:135:7:property:n
./comb/guangtao/homeProfiles.nix:136:7:property:rd
./comb/guangtao/homeProfiles.nix:137:7:property:sc
./comb/guangtao/homeProfiles.nix:140:5:property:initExtra
./comb/_automation/nixago/tasks.nix:2:3:property:fmt
./comb/_automation/nixago/tasks.nix:3:5:property:description
./comb/_automation/nixago/tasks.nix:4:5:property:content
./comb/_automation/nixago/tasks.nix:8:3:property:home
./comb/_automation/nixago/tasks.nix:9:5:property:description
./comb/_automation/nixago/tasks.nix:10:5:property:content
./comb/guangtao/userProfiles.nix:5:3:property:l
./comb/guangtao/userProfiles.nix:7:3:property:default.users.users."${l.baseNameOf ./.}"
./comb/guangtao/userProfiles.nix:8:5:property:password
./comb/guangtao/userProfiles.nix:9:5:property:description
./comb/guangtao/userProfiles.nix:10:5:property:isNormalUser
./comb/guangtao/userProfiles.nix:11:5:property:extraGroups
./comb/_automation/nixago/default.nix:7:3:property:treefmt
./comb/_automation/nixago/default.nix:8:5:property:configData.formatter.prettier
./comb/_automation/nixago/default.nix:9:7:property:excludes
./comb/_automation/nixago/default.nix:14:5:property:configData.formatter.nix
./comb/_automation/nixago/default.nix:15:7:property:excludes
./comb/_automation/nixago/default.nix:18:3:property:mdbook
./comb/_automation/nixago/default.nix:19:5:property:configData
./comb/_automation/nixago/default.nix:20:7:property:book.title
./comb/_automation/nixago/default.nix:23:3:property:just
./comb/_automation/nixago/default.nix:24:5:property:configData
./comb/_automation/nixago/default.nix:25:7:property:tasks
./comb/guangtao/homeSuites.nix:9:3:property:shell
./comb/guangtao/colmenaConfigurations.nix:8:3:property:l
./comb/guangtao/colmenaConfigurations.nix:11:5:property:home
./comb/guangtao/colmenaConfigurations.nix:12:7:property:imports
./comb/guangtao/colmenaConfigurations.nix:16:11:property:home-manager.useGlobalPkgs
./comb/guangtao/colmenaConfigurations.nix:17:11:property:home-manager.useUserPackages
./comb/guangtao/colmenaConfigurations.nix:18:11:property:home-manager.users."${l.baseNameOf ./.}"
./comb/guangtao/colmenaConfigurations.nix:19:13:property:imports
./comb/guangtao/secretProfiles.nix:5:3:property:guangtao
./comb/guangtao/secretProfiles.nix:6:5:property:openssh.authorizedKeys.keys
./comb/_automation/devshells/default.nix:5:3:property:l
./comb/_automation/devshells/default.nix:7:3:property:withCategory
./comb/_automation/devshells/default.nix:10:5:property:default
./comb/_automation/devshells/default.nix:15:7:property:name
./comb/_automation/devshells/default.nix:16:7:property:std.docs.enable
./comb/_automation/devshells/default.nix:17:7:property:git.hooks
./comb/_automation/devshells/default.nix:18:9:property:enable
./comb/_automation/devshells/default.nix:20:7:property:imports
./comb/_automation/devshells/default.nix:25:7:property:nixago
./comb/_automation/devshells/default.nix:27:7:property:commands
./comb/_automation/devshells/default.nix:28:10:property:package
./comb/_automation/devshells/default.nix:29:10:property:package
./comb/_automation/devshells/default.nix:32:11:property:name
./comb/_automation/devshells/default.nix:33:11:property:help
./comb/_automation/devshells/default.nix:34:11:property:command
./comb/_automation/devshells/default.nix:39:7:property:packages
./comb/guangtao/homeModules/default.nix:5:3:property:alacritty
./comb/guangtao/homeConfigurations.nix:11:3:property:name
./comb/guangtao/homeConfigurations.nix:14:3:property:email
./comb/guangtao/homeConfigurations.nix:15:3:property:gitSigningKey
./comb/guangtao/homeConfigurations.nix:18:5:property:blaggacao
./comb/guangtao/homeConfigurations.nix:19:7:property:imports
./comb/guangtao/homeConfigurations.nix:20:7:property:programs.browserpass.enable
./comb/guangtao/homeConfigurations.nix:21:7:property:programs.git
./comb/guangtao/homeConfigurations.nix:22:9:property:userName
./comb/guangtao/homeConfigurations.nix:23:9:property:userEmail
./comb/guangtao/homeConfigurations.nix:24:9:property:signing
./comb/guangtao/homeConfigurations.nix:25:11:property:key
./comb/guangtao/homeConfigurations.nix:26:11:property:signByDefault
./comb/omega/homeSuites.nix:9:3:property:shell
./comb/omega/colmenaConfigurations.nix:9:5:property:blacklion
./comb/omega/colmenaConfigurations.nix:10:7:property:imports
./comb/guangtao/homeModules/programs/alacritty/default.nix:8:3:property:cfg
./comb/guangtao/homeModules/programs/alacritty/default.nix:9:3:property:CSIuKeyBindings
./comb/guangtao/homeModules/programs/alacritty/default.nix:11:3:property:options
./comb/guangtao/homeModules/programs/alacritty/default.nix:12:5:property:programs.alacritty
./comb/guangtao/homeModules/programs/alacritty/default.nix:13:7:property:CSIuSupport
./comb/guangtao/homeModules/programs/alacritty/default.nix:17:3:property:config
./comb/guangtao/homeModules/programs/alacritty/default.nix:19:7:property:programs.alacritty.settings.key_bindings
./comb/omega/nixosProfiles.nix:7:3:property:default
./comb/omega/nixosProfiles.nix:8:5:property:nix
./comb/omega/nixosProfiles.nix:9:7:property:package
./comb/omega/nixosProfiles.nix:10:7:property:gc.automatic
./comb/omega/nixosProfiles.nix:11:7:property:gc.options
./comb/omega/nixosProfiles.nix:12:7:property:optimise.automatic
./comb/omega/nixosProfiles.nix:13:7:property:autoOptimiseStore
./comb/omega/nixosProfiles.nix:14:7:property:extraOptions
./comb/omega/nixosProfiles.nix:17:7:property:binaryCaches
./comb/omega/nixosProfiles.nix:18:7:property:binaryCachePublicKeys
./comb/omega/homeProfiles.nix:7:3:property:bat.programs.bat.enable
./comb/omega/homeProfiles.nix:8:3:property:broot.programs.broot.enable
./comb/omega/homeProfiles.nix:9:3:property:direnv.programs.direnv.enable
./comb/omega/homeProfiles.nix:10:3:property:fzf.programs.fzf.enable
./comb/omega/homeProfiles.nix:11:3:property:gpg.programs.gpg.enable
./comb/omega/homeProfiles.nix:12:3:property:jq.programs.jq.enable
./comb/omega/homeProfiles.nix:13:3:property:mcfly.programs.mcfly.enable
./comb/omega/homeProfiles.nix:14:3:property:starship.programs.starship.enable
./comb/omega/homeProfiles.nix:15:3:property:zoxide.programs.zoxide.enable
./comb/omega/homeProfiles.nix:16:3:property:gh.programs.gh
./comb/omega/homeProfiles.nix:17:5:property:enable
./comb/omega/homeProfiles.nix:18:5:property:settings.git_protocol
./comb/omega/homeProfiles.nix:20:3:property:packages.home.packages
./comb/omega/homeProfiles.nix:52:3:property:alacritty.programs.alacritty
./comb/omega/homeProfiles.nix:53:5:property:enable
./comb/omega/homeProfiles.nix:54:5:property:CSIuSupport
./comb/omega/homeProfiles.nix:55:5:property:settings
./comb/omega/homeProfiles.nix:56:7:property:env.TERM
./comb/omega/homeProfiles.nix:57:7:property:window.decorations
./comb/omega/homeProfiles.nix:58:7:property:font.size
./comb/omega/homeProfiles.nix:59:7:property:cursor.style
./comb/omega/homeProfiles.nix:62:7:property:colors
./comb/omega/homeProfiles.nix:64:9:property:primary
./comb/omega/homeProfiles.nix:65:11:property:background
./comb/omega/homeProfiles.nix:66:11:property:foreground
./comb/omega/homeProfiles.nix:70:9:property:normal
./comb/omega/homeProfiles.nix:71:11:property:black
./comb/omega/homeProfiles.nix:72:11:property:red
./comb/omega/homeProfiles.nix:73:11:property:green
./comb/omega/homeProfiles.nix:74:11:property:yellow
./comb/omega/homeProfiles.nix:75:11:property:blue
./comb/omega/homeProfiles.nix:76:11:property:magenta
./comb/omega/homeProfiles.nix:77:11:property:cyan
./comb/omega/homeProfiles.nix:78:11:property:white
./comb/omega/homeProfiles.nix:82:9:property:bright
./comb/omega/homeProfiles.nix:83:11:property:black
./comb/omega/homeProfiles.nix:84:11:property:red
./comb/omega/homeProfiles.nix:85:11:property:green
./comb/omega/homeProfiles.nix:86:11:property:yellow
./comb/omega/homeProfiles.nix:87:11:property:blue
./comb/omega/homeProfiles.nix:88:11:property:magenta
./comb/omega/homeProfiles.nix:89:11:property:cyan
./comb/omega/homeProfiles.nix:90:11:property:white
./comb/omega/homeProfiles.nix:95:3:property:git.programs.git
./comb/omega/homeProfiles.nix:96:5:property:enable
./comb/omega/homeProfiles.nix:97:5:property:delta.enable
./comb/omega/homeProfiles.nix:98:5:property:lfs.enable
./comb/omega/homeProfiles.nix:100:5:property:delta.options
./comb/omega/homeProfiles.nix:101:7:property:plus-style
./comb/omega/homeProfiles.nix:102:7:property:minus-style
./comb/omega/homeProfiles.nix:103:7:property:syntax-theme
./comb/omega/homeProfiles.nix:104:7:property:navigate
./comb/omega/homeProfiles.nix:107:5:property:extraConfig
./comb/omega/homeProfiles.nix:108:7:property:core.autocrlf
./comb/omega/homeProfiles.nix:109:7:property:init.defaultBranch
./comb/omega/homeProfiles.nix:110:7:property:pull.rebase
./comb/omega/homeProfiles.nix:111:7:property:rebase.autosquash
./comb/omega/homeProfiles.nix:112:7:property:rerere.enabled
./comb/omega/homeProfiles.nix:115:3:property:zsh.programs.zsh
./comb/omega/homeProfiles.nix:116:5:property:enable
./comb/omega/homeProfiles.nix:117:5:property:enableAutosuggestions
./comb/omega/homeProfiles.nix:118:5:property:enableCompletion
./comb/omega/homeProfiles.nix:119:5:property:autocd
./comb/omega/homeProfiles.nix:120:5:property:history.share
./comb/omega/homeProfiles.nix:121:5:property:dotDir
./comb/omega/homeProfiles.nix:122:5:property:shellGlobalAliases
./comb/omega/homeProfiles.nix:127:5:property:shellAliases
./comb/omega/homeProfiles.nix:128:7:property:d
./comb/omega/homeProfiles.nix:129:7:property:g
./comb/omega/homeProfiles.nix:130:7:property:jc
./comb/omega/homeProfiles.nix:131:7:property:la
./comb/omega/homeProfiles.nix:132:7:property:l
./comb/omega/homeProfiles.nix:133:7:property:ls
./comb/omega/homeProfiles.nix:134:7:property:md
./comb/omega/homeProfiles.nix:135:7:property:n
./comb/omega/homeProfiles.nix:136:7:property:rd
./comb/omega/homeProfiles.nix:137:7:property:sc
./comb/omega/homeProfiles.nix:140:5:property:initExtra
./comb/omega/homeConfigurations.nix:11:3:property:name
./comb/omega/homeConfigurations.nix:12:3:property:email
./comb/omega/homeConfigurations.nix:13:3:property:gitSigningKey
./comb/omega/homeConfigurations.nix:16:5:property:omega
./comb/omega/homeConfigurations.nix:17:7:property:imports
./comb/omega/homeConfigurations.nix:18:7:property:programs.git
./comb/omega/homeConfigurations.nix:19:9:property:userName
./comb/omega/homeConfigurations.nix:20:9:property:userEmail
./comb/omega/colmenaConfigurations/blacklion/zfs.nix:6:3:property:boot.supportedFilesystems
./comb/omega/colmenaConfigurations/blacklion/zfs.nix:7:3:property:networking.hostId
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:11:3:property:imports
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:15:3:property:boot.initrd.availableKernelModules
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:16:3:property:boot.initrd.kernelModules
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:17:3:property:boot.kernelModules
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:18:3:property:boot.extraModulePackages
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:20:3:property:fileSystems."/"
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:21:5:property:device
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:22:5:property:fsType
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:25:3:property:fileSystems."/boot"
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:26:5:property:device
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:27:5:property:fsType
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:30:3:property:swapDevices
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:32:7:property:device
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:36:3:property:powerManagement.cpuFreqGovernor
./comb/omega/colmenaConfigurations/blacklion/hardware-configuration.nix:37:3:property:hardware.cpu.intel.updateMicrocode
./comb/_QUEEN/nixosProfiles.nix:7:3:property:bootstrap
./comb/_QUEEN/colmenaConfigurations.nix:9:5:property:larva
./comb/_QUEEN/colmenaConfigurations.nix:10:7:property:deployment
./comb/_QUEEN/colmenaConfigurations.nix:11:9:property:targetHost
./comb/_QUEEN/colmenaConfigurations.nix:12:9:property:targetPort
./comb/_QUEEN/colmenaConfigurations.nix:13:9:property:targetUser
./comb/_QUEEN/colmenaConfigurations.nix:15:7:property:imports
./comb/omega/colmenaConfigurations/blacklion/default.nix:10:3:property:imports
./comb/omega/colmenaConfigurations/blacklion/default.nix:16:3:property:nixpkgs.config.allowUnfree
./comb/omega/colmenaConfigurations/blacklion/default.nix:19:3:property:boot.loader.systemd-boot.enable
./comb/omega/colmenaConfigurations/blacklion/default.nix:20:3:property:boot.loader.efi.canTouchEfiVariables
./comb/omega/colmenaConfigurations/blacklion/default.nix:25:3:property:time.timeZone
./comb/omega/colmenaConfigurations/blacklion/default.nix:30:3:property:networking.useDHCP
./comb/omega/colmenaConfigurations/blacklion/default.nix:31:3:property:networking.interfaces.eno1.useDHCP
./comb/omega/colmenaConfigurations/blacklion/default.nix:32:3:property:networking.interfaces.wlo1.useDHCP
./comb/omega/colmenaConfigurations/blacklion/default.nix:46:3:property:services.xserver.enable
./comb/omega/colmenaConfigurations/blacklion/default.nix:48:3:property:services.sshd.enable
./comb/omega/colmenaConfigurations/blacklion/default.nix:51:3:property:services.xserver.displayManager.gdm.enable
./comb/omega/colmenaConfigurations/blacklion/default.nix:52:3:property:services.xserver.desktopManager.gnome.enable
./comb/omega/colmenaConfigurations/blacklion/default.nix:62:3:property:sound.enable
./comb/omega/colmenaConfigurations/blacklion/default.nix:63:3:property:hardware.pulseaudio.enable
./comb/omega/colmenaConfigurations/blacklion/default.nix:66:3:property:services.xserver.libinput.enable
./comb/omega/colmenaConfigurations/blacklion/default.nix:69:3:property:users.users.omega
./comb/omega/colmenaConfigurations/blacklion/default.nix:70:5:property:isNormalUser
./comb/omega/colmenaConfigurations/blacklion/default.nix:71:5:property:initialPassword
./comb/omega/colmenaConfigurations/blacklion/default.nix:72:5:property:extraGroups
./comb/omega/colmenaConfigurations/blacklion/default.nix:77:3:property:environment.systemPackages
./comb/omega/colmenaConfigurations/blacklion/default.nix:113:3:property:system.stateVersion
./comb/_QUEEN/lib.nix:8:3:property:lay
./comb/_QUEEN/lib.nix:9:5:property:meta.nodeNixpkgs.${host}
./comb/_QUEEN/lib.nix:19:3:property:bearHomeConfiguration
./comb/_QUEEN/lib.nix:20:5:property:homeDirectoryPrefix
./comb/_QUEEN/lib.nix:24:5:property:homeDirectory
./comb/_QUEEN/lib.nix:25:5:property:builder
./comb/_QUEEN/lib.nix:26:5:property:configuration
./comb/_QUEEN/lib.nix:27:7:property:imports
./comb/_QUEEN/lib.nix:31:17:property:targets.genericLinux.enable
./comb/_QUEEN/lib.nix:36:11:property:home
./comb/_QUEEN/lib.nix:37:11:property:home.stateVersion
./comb/_QUEEN/lib.nix:45:7:property:pkgs
./comb/_QUEEN/nixosProfiles/bootstrap.nix:11:3:property:nix
./comb/_QUEEN/nixosProfiles/bootstrap.nix:12:5:property:package
./comb/_QUEEN/nixosProfiles/bootstrap.nix:13:5:property:extraOptions
./comb/_QUEEN/nixosProfiles/bootstrap.nix:18:3:property:networking.domain
./comb/_QUEEN/nixosProfiles/bootstrap.nix:19:3:property:isoImage.isoBaseName
./comb/_QUEEN/nixosProfiles/bootstrap.nix:20:3:property:isoImage.contents
./comb/_QUEEN/nixosProfiles/bootstrap.nix:22:7:property:source
./comb/_QUEEN/nixosProfiles/bootstrap.nix:23:7:property:target
./comb/_QUEEN/nixosProfiles/bootstrap.nix:26:3:property:systemd.network
./comb/_QUEEN/nixosProfiles/bootstrap.nix:28:5:property:networks."boostrap-link-local"
./comb/_QUEEN/nixosProfiles/bootstrap.nix:29:7:property:matchConfig
./comb/_QUEEN/nixosProfiles/bootstrap.nix:30:9:property:Name
./comb/_QUEEN/nixosProfiles/bootstrap.nix:32:7:property:networkConfig
./comb/_QUEEN/nixosProfiles/bootstrap.nix:33:9:property:Description
./comb/_QUEEN/nixosProfiles/bootstrap.nix:34:9:property:MulticastDNS
./comb/_QUEEN/nixosProfiles/bootstrap.nix:35:9:property:LinkLocalAddressing
./comb/_QUEEN/nixosProfiles/bootstrap.nix:36:9:property:DHCP
./comb/_QUEEN/nixosProfiles/bootstrap.nix:38:7:property:address
./comb/_QUEEN/nixosProfiles/bootstrap.nix:42:7:property:extraConfig
#+end_example
